In [4]:
import pandas as pd 
pd.__version__

'1.3.4'

In [5]:
# Make a DataFrame 
data = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [6]:
data

   A  B
0  1  4
1  2  5
2  3  6

In [7]:
import numpy as np

In [8]:
# DataFrame using np.array
data = pd.DataFrame(np.random.randn(3, 4), columns=['A', 'B', 'C', 'D'])

In [9]:
data

          A         B         C         D
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [10]:
data.rename(columns={'A': 'a', 'B': 'b', 'C': 'c', 'D': 'd'}, inplace=True)

In [11]:
data

          a         b         c         d
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [12]:
data.columns = ("a_a", "b_b", "c_c", "d_d")

In [13]:
data

        a_a       b_b       c_c       d_d
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [14]:
data.columns=data.columns.str.replace('_', '')

In [15]:
data

         aa        bb        cc        dd
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [16]:
# Adding prefix to columns
data.add_prefix('pre_')

     pre_aa    pre_bb    pre_cc    pre_dd
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [17]:
data

         aa        bb        cc        dd
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [18]:
data.columns = ("a_a", "b_b", "c_c", "d_d")

In [19]:
data

        a_a       b_b       c_c       d_d
0  1.634298  0.044707  1.812542 -2.400218
1  0.811860 -1.001781 -0.494219  1.010921
2  0.008977  0.091809 -0.753666  1.034256

In [1]:
# Using template data
import pandas as pd
import numpy as np
import seaborn as sns   # For plotting
import matplotlib.pyplot as plt
titanic = sns.load_dataset("titanic")
titanic.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
# Summary of data
titanic.describe()

,Unnamed: 0,survived,pclass,age,sibsp,parch,fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
# Columns names
titanic.columns

Index(['Unnamed: 0', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [5]:
# Saving data to csv
titanic.to_csv("titanic.csv")
iris.to_csv("iris.csv")

In [6]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\sartaj\anaconda3\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\sartaj\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [7]:
# Saving data to excel
titanic.to_excel("titanic.xlsx")

In [8]:
# Saving data to numpy file
titanic.to_csv("titanic.npy")

In [9]:
# Using our own data
data = pd.read_csv("titanic.csv")
data.head()

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
# Reverse row order
data.iloc[::-1]

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False

In [11]:
# reset index
data.reset_index(drop=True)

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [12]:
# Reverse column order
data.iloc[:, ::-1]

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived,Unnamed: 0.1,Unnamed: 0
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0,0,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1,2,2
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1,3,3
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0,4,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,no,Southampton,NaN,True,man,Second,S,13.0000,0,0,27.0,male,2,0,886,886
887,True,yes,Southampton,B,False,woman,First,S,30.0000,0,0,19.0,female,1,1,887,887
888,False,no,Southampton,NaN,False,woman,Third,S,23.4500,2,1,NaN,female,3,0,888,888
889,True,yes,Cherbourg,C,True,man,First,C,30.0000,0,0,26.0,male,1,1,889,889
890,True,no,Queenstown,NaN,True,man,Third,Q,7.7500,0,0,32.0,male,3,0,890,890

In [16]:
# select number in data frame
data.select_dtypes(include=['number'])

     Unnamed: 0  Unnamed: 0.1  survived  pclass   age  sibsp  parch     fare
0             0             0         0       3  22.0      1      0   7.2500
1             1             1         1       1  38.0      1      0  71.2833
2             2             2         1       3  26.0      0      0   7.9250
3             3             3         1       1  35.0      1      0  53.1000
4             4             4         0       3  35.0      0      0   8.0500
..          ...           ...       ...     ...   ...    ...    ...      ...
886         886           886         0       2  27.0      0      0  13.0000
887         887           887         1       1  19.0      0      0  30.0000
888         888           888         0       3   NaN      1      2  23.4500
889         889           889         1       1  26.0      0      0  30.0000
890         890           890         0       3  32.0      0      0   7.7500

[891 rows x 8 columns]

In [17]:
# select object in data frame
data.select_dtypes(include=['object'])

        sex embarked   class    who deck  embark_town alive
0      male        S   Third    man  NaN  Southampton    no
1    female        C   First  woman    C    Cherbourg   yes
2    female        S   Third  woman  NaN  Southampton   yes
3    female        S   First  woman    C  Southampton   yes
4      male        S   Third    man  NaN  Southampton    no
..      ...      ...     ...    ...  ...          ...   ...
886    male        S  Second    man  NaN  Southampton    no
887  female        S   First  woman    B  Southampton   yes
888  female        S   Third  woman  NaN  Southampton    no
889    male        C   First    man    C    Cherbourg   yes
890    male        Q   Third    man  NaN   Queenstown    no

[891 rows x 7 columns]

In [18]:
data.select_dtypes(include=['number', 'object'])

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton,yes
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,NaN,Southampton,no
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,B,Southampton,yes
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,NaN,Southampton,no
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,C,Cherbourg,yes
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,Queenstown,no

In [20]:
# exclude number in data frame
data.select_dtypes(exclude=['number'])

        sex embarked   class    who  adult_male deck  embark_town alive  alone
0      male        S   Third    man        True  NaN  Southampton    no  False
1    female        C   First  woman       False    C    Cherbourg   yes  False
2    female        S   Third  woman       False  NaN  Southampton   yes   True
3    female        S   First  woman       False    C  Southampton   yes  False
4      male        S   Third    man        True  NaN  Southampton    no   True
..      ...      ...     ...    ...         ...  ...          ...   ...    ...
886    male        S  Second    man        True  NaN  Southampton    no   True
887  female        S   First  woman       False    B  Southampton   yes   True
888  female        S   Third  woman       False  NaN  Southampton    no  False
889    male        C   First    man        True    C    Cherbourg   yes   True
890    male        Q   Third    man        True  NaN   Queenstown    no   True

[891 rows x 9 columns]

In [23]:
#type casting
df = data.astype(str)

In [24]:
df.dtypes

Unnamed: 0      object
Unnamed: 0.1    object
survived        object
pclass          object
sex             object
age             object
sibsp           object
parch           object
fare            object
embarked        object
class           object
who             object
adult_male      object
deck            object
embark_town     object
alive           object
alone           object
dtype: object

In [25]:
df.dtypes == 'object'

Unnamed: 0      True
Unnamed: 0.1    True
survived        True
pclass          True
sex             True
age             True
sibsp           True
parch           True
fare            True
embarked        True
class           True
who             True
adult_male      True
deck            True
embark_town     True
alive           True
alone           True
dtype: bool

In [31]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [33]:
df.astype({'A': 'int64', 'B': 'float64'}).dtypes

A      int64
B    float64
dtype: object

In [38]:
pd.to_numeric(df['B'], errors='coerce').dtypes

dtype('int64')

In [39]:
# Reduce dataframe size
data.head(2)

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [40]:
ns = sns.load_dataset("titanic")
ns.shape

(891, 16)

In [41]:
ns.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    object
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    object
 9   class        891 non-null    category
 10  who          891 non-null    object
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    category
 13  embark_town  889 non-null    object
 14  alive        891 non-null    object
 15  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(5), object(5)
memory usage: 320.7 KB

In [42]:
ns.sample(frac=0.5).shape

(446, 16)

In [43]:
# copy data from clipboard
# data set download 
data = pd.read_csv("titanic.csv")
data.to_excel("kashti.xlsx")

In [49]:
# read clipboard data
data = pd.read_clipboard()
data

Empty DataFrame
Columns: [download]
Index: []

In [2]:
a,b,c = map(int,input().split())

count = 0 
for i in range(a,b+1):
    if c%i ==0:
        count = count + 1
print(count)

3

In [58]:
def solution(n, a):
    b= a
    b[0] = 0 + a[0] + a[1]
    for i in range(n-2):
        b[i]=a[i] + a[i+1] + a[i+2]

In [70]:
def solution(n, a):
    b = a 
    b[0] = 0 + a[0] + a[1]
    for i in range(n):
        for j in range(i-1):
            b[j] = a[j] + a[j+1] + a[j+2]

In [71]:
n = 5 
a = [4, 0, 1, -2, 3]
solution (n, a)

In [72]:
b

[6, -2, 2, -2, 3]

In [66]:
b =a

In [50]:
b

[4, 0, 1, -2, 3]

In [5]:
a,b = map(int,input().split())
d = a//b
r = a%b
g = a/b
print(d,r,f'{g:.10f}')

1 1 1.5000000000

In [12]:
from math import pi
a = float(input())
area = pi * a**2
cir = 2 * pi * a
print("%.6f"%area, "%.6f"%cir)

12.566371 12.566371

In [18]:
while True:
    t = input().split()
    a = int(t[0])
    op = t[1]
    b = int(t[2])
    if op == '?':
        break
    if op == '+':
        print("%d"%(a+b))
    elif op == '-':
        print("%d"%(a-b))
    elif op == '/':
        print("%d"%(a/b))
    else:
        print("%d"%(a*b))

3

ValueError: invalid literal for int() with base 10: '#'

In [1]:
#split data frame into two subsets
import pandas as pd
data = pd.read_csv("titanic.csv")
data.head()
len(data)

891

In [2]:
ks = data.sample(frac=0.5, random_state=1)

In [3]:
ks.head()

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,862,862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,223,223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,84,84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,680,680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,535,535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [23]:
len(ks)

446

In [4]:
n = int(input())
a = list(map(int, input().split()))

ValueError: invalid literal for int() with base 10: ''

In [33]:
a

[12, 23, 34, 15, 15]

In [34]:
min = a[0]
max = a[0]
sum = 0

34 12 99

In [6]:
# Filtering a dataset 
data.head()

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
data.sex.unique()

array(['male', 'female'], dtype=object)

In [8]:
data[data.sex == 'female']

,Unnamed: 0,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,8,8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,9,9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,880,880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,882,882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,885,885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [11]:
data.pclass.unique()

array([3, 1, 2], dtype=int64)

In [12]:
# Filtering by large catergories
data.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [13]:
(data.age > 50).value_counts()

False    827
True      64
Name: age, dtype: int64

In [14]:
data.age.value_counts().nlargest(3)

24.0    30
22.0    27
18.0    26
Name: age, dtype: int64

In [15]:
data['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64